# FamilyElectricalMaintainAnnotationOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyElectricalMaintainAnnotationOrientation Property
ParameterTypeId Class See Also
---
"Maintain Annotation Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyElectricalMaintainAnnotationOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyElectricalMaintainAnnotationOrientation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyElectricalMaintainAnnotationOrientation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace